Repository: ErikaIwakiri/DebianCorpus
Catalog: TmxMerged.tmx
Source language: en_us
Languages: pt_pt

source: 3. If the withdrawal of the proposer and/or sponsors means that a ballot option has no proposer or not enough sponsors to meet the requirements for a new resolution, and 24 hours pass without this being remedied by another proposer and/or sponsors stepping forward, it is removed from the draft ballot. This does not change the length of the discussion period.
pt_pt: 3. Se a desistência do(a) proponente e/ou dos(as) padrinhos/madrinhas significar que uma opção de votação não tem proponente ou não tem padrinhos/madrinhas suficientes para atender aos requisitos para uma nova resolução, e 24 horas se passaram sem que isso seja sanado por outro(a) proponente e/ou padrinhos/madrinhas tomando a frente, ela é removida do rascunho da cédula de votação. Isso não altera a duração do período de discussão.

source: 4. If all ballot options except the default option are withdrawn, the resolution is canceled and will not be voted on.
pt_pt: 4. Se todas as opções de votação, exceto a opção padrão, forem retiradas, a resolução será cancelada e não será votada.

source: A.3. Calling for a vote
pt_pt: A.3. Chamada para uma votação

source: 1. After the discussion period has ended, the Project Secretary will publish the ballot and call for a vote. The Project Secretary may do this immediately following the end of the discussion period and must do so within seven days of the end of the discussion period.
pt_pt: 1. Após o término do período de discussão, o(a) secretário(a) do Projeto publicará a cédula e convocará uma votação. O(A) secretário(a) do Projeto pode fazer isso imediatamente após o término do período de discussão e deve fazê-lo no prazo de sete dias após o término do período de discussão.

source: 2. The Project Secretary determines the order of ballot options and their summaries used for the ballot. The Project Secretary may ask ballot option proposers to draft those summaries, and may revise them for clarity at their discretion.
pt_pt: 2. O(A) secretário(a) do Projeto determina a ordem das opções de votação e seus resumos usados para a votação. O(A) secretário(a) do Projeto pode pedir aos(às) proponentes das opções de votação que escrevam esses resumos e pode revisá-los para maior clareza a seu critério.

source: 3. Minor changes to ballot options under §A.1.5 may only be made if at least 24 hours remain in the discussion period, or if the Project Secretary agrees the change does not alter the meaning of the ballot option and (if it would do so) warrants delaying the vote. The Project Secretary will allow 24 hours for objections after any such change before issuing the call for a vote.
pt_pt: 3. Pequenas alterações nas opções de votação sob §A.1.5 só podem ser feitas se restar pelo menos 24 horas do período de discussão, ou se o(a) secretário(a) do Projeto concordar que a mudança não altera o significado da opção de votação e (se ao fazer isso) justifica o adiamento da votação. O(A) secretário(a) do Projeto concederá 24 horas para objeções após qualquer alteração antes de emitir a convocação para votação.

source: 4. No new ballot options may be proposed, no ballot options may be amended, and no proposers or sponsors may withdraw if less than 24 hours remain in the discussion period, unless this action successfully extends the discussion period under §A.1.4 by at least 24 additional hours.
pt_pt: 4. Nenhuma nova opção de votação pode ser proposta, nenhuma opção de votação pode ser alterada e nenhum(a) proponente ou padrinho/madrinha pode desistir se restar menos de 24 horas do período de discussão, a menos que esta ação estenda com sucesso o período de discussão sob §A.1.4 em pelo menos 24 horas adicionais.

source: 5. Actions to preserve the existing ballot may be taken within the last 24 hours of the discussion period, namely a sponsor objecting to an amendment under §A.1.3, a Developer objecting to a minor change under §A.1.5, stepping forward as the proposer for an existing ballot option whose original proposer has withdrawn it under §A.2.1, or sponsoring an existing ballot option that has fewer than the required number of sponsors because of the withdrawal of a sponsor under point §A.2.2.
pt_pt: 5. Ações para preservar a cédula existente podem ser tomadas nas últimas 24 horas do período de discussão, ou seja, um(a) padrinho/madrinha se opondo a uma alteração sob §A.1.3, um(a) desenvolvedor(a) se opondo a uma pequena alteração sob §A.1.5, apresentar-se como proponente de uma opção de voto existente cujo(a) proponente original a retirou sob §A.2.1, ou apadrinhar/amadrinhar uma opção de voto existente que tenha menos do que o número necessário de padrinhos/madrinhas devido à retirada de um padrinho/madrinha sob o ponto §A.2.2.

source: 6. The Project Secretary may make an exception to §A.3.4 and accept changes to the ballot after they are no longer allowed, provided that this is done at least 24 hours prior to the issuance of a call for a vote. All other requirements for making a change to the ballot must still be met. This is expected to be rare and should only be done if the Project Secretary believes it would be harmful to the best interests of the project for the change to not be made.
pt_pt: 6. O(A) secretário(a) do Projeto pode fazer uma exceção ao §A.3.4 e aceitar alterações na cédula depois que alterações não forem mais permitidas, desde que isso seja feito pelo menos 24 horas antes da emissão da chamada para votação. Todos os outros requisitos para fazer uma mudança na cédula ainda devem ser atendidos. Espera-se que isso seja raro e só deve ser feito se o(a) secretário(a) do Projeto acreditar que seria prejudicial aos melhores interesses do projeto que a mudança não fosse feita.

source: A.4. Voting procedure
pt_pt: A.4. Procedimento de votação

source: 1. Options which do not have an explicit supermajority requirement have a 1:1 majority requirement. The default option does not have any supermajority requirements.
pt_pt: 1. As opções que não têm um requisito explícito de supermaioria têm um requisito de maioria de 1:1. A opção padrão não tem nenhum requisito de supermaioria.

source: 2. The votes are counted according to the rules in §A.5.
pt_pt: 2. Os votos são contados de acordo com as regras em §A.5.

source: 3. In cases of doubt the Project Secretary shall decide on matters of procedure.
pt_pt: 3. Em caso de dúvida, o(a) secretário(a) do Projeto decidirá sobre questões de procedimento.

source: A.5. Vote Counting
pt_pt: A.5. Contagem de votos

source: 1. Each voter's ballot ranks the options being voted on. Not all options need be ranked. Ranked options are considered preferred to all unranked options. Voters may rank options equally. Unranked options are considered to be ranked equally with one another. Details of how ballots may be filled out will be included in the Call For Votes.
pt_pt: 1. A cédula de cada votante gradua as opções que estão sendo votadas. Nem todas as opções precisam ser graduadas. Opções graduadas são consideradas preferidas em relação às não graduadas. Votantes podem graduar opções igualmente. Opções não graduadas são consideradas como graduadas igualmente entre si. Detalhes de como as cédulas podem ser preenchidas serão incluídas na chamada para votos.

source: 2. If the ballot has a quorum requirement R any options other than the default option which do not receive at least R votes ranking that option above the default option are dropped from consideration.
pt_pt: 2. Se a votação tiver um requerimento de quorum R, quaisquer opções que não sejam a padrão que não receberem pelo menos R votos graduando aquela opção acima da padrão são desconsideradas.

source: 3. Any (non-default) option which does not defeat the default option by its required majority ratio is dropped from consideration.
pt_pt: 3. Qualquer opção (não padrão) que não vencer a opção padrão na sua proporção requerida de maioria é desconsiderada.

source: 1. Given two options A and B, V(A,B) is the number of voters who prefer option A over option B.
pt_pt: 1. Dadas duas opções A e B, V(A,B) é o número de votantes que preferem a opção A sobre a opção B.

source: 2. An option A defeats the default option D by a majority ratio N, if V(A,D) is greater or equal to N * V(D,A) and V(A,D) is strictly greater than V(D,A).
pt_pt: 2. Uma opção A vence a opção padrão D por uma proporção de maioria N, se V(A,D) for maior ou igual que N * V(D,A) e V(A,D) for estritamente maior que V(D,A).

source: 3. If a supermajority of S:1 is required for A, its majority ratio is S; otherwise, its majority ratio is 1.
pt_pt: 3. Se uma supermaioria de S:1 é requerida para A, sua proporção de maioria é S; caso contrário, sua proporção de maioria é 1.

source: 4. From the list of undropped options, we generate a list of pairwise defeats.
pt_pt: 4. Da lista de opções consideradas, nós geramos uma lista de vitórias em pares.

source: 1. An option A defeats an option B, if V(A,B) is strictly greater than V(B,A).
pt_pt: 1. Uma opção A vence uma opção B se V(A,B) for estritamente maior que V(B,A)

source: 5. From the list of [undropped] pairwise defeats, we generate a set of transitive defeats.
pt_pt: 5. Da lista de vitórias em pares [consideradas], nós geramos um conjunto de vitórias transitivas.

source: 1. An option A transitively defeats an option C if A defeats C or if there is some other option B where A defeats B AND B transitively defeats C.
pt_pt: 1. Uma opção A vence transitivamente uma opção C se A vencer C ou se há alguma outra opção B onde A vence B, e B transitivamente vence C.

source: 6. We construct the Schwartz set from the set of transitive defeats.
pt_pt: 6. Nós construímos o conjunto de Schwartz a partir do conjunto de vitórias transitivas.

source: 1. An option A is in the Schwartz set if for all options B, either A transitively defeats B, or B does not transitively defeat A.
pt_pt: 1. Uma opção A está no conjunto de Schwartz se para todas as opções B, A vence transitivamente B, ou B não vence transitivamente A.

source: 7. If there are defeats between options in the Schwartz set, we drop the weakest such defeats from the list of pairwise defeats, and return to step 5.
pt_pt: 7. Se houver vitórias entre opções no conjunto de Schwartz, nós removemos a mais fraca destas vitórias da lista de vitórias em pares, e retornamos para o passo 5.

source: 1. A defeat (A,X) is weaker than a defeat (B,Y) if V(A,X) is less than V(B,Y). Also, (A,X) is weaker than (B,Y) if V(A,X) is equal to V(B,Y) and V(X,A) is greater than V(Y,B).
pt_pt: 1. Uma vitória (A,X) é mais fraca que uma vitória (B,Y) se V(A,X) for menor que V(B,Y). Além disso, (A,X) é mais fraca que (B,Y) se V(A,X) é igual a V(B,Y) e V(X,A) é maior que V(Y,B).

source: 2. A weakest defeat is a defeat that has no other defeat weaker than it. There may be more than one such defeat.
pt_pt: 2. Uma vitória fraquíssima é aquela que não possui uma vitória mais fraca que ela. Pode haver mais que uma destas vitórias.

source: 8. If there are no defeats within the Schwartz set, then the winner is chosen from the options in the Schwartz set. If there is only one such option, it is the winner. If there are multiple options, the elector with the casting vote chooses which of those options wins.
pt_pt: 8. Se não houver vitórias dentro do conjunto de Schwartz, então o(a) vencedor(a) é escolhido(a) a partir das opções do conjunto de Schwartz. Se houver apenas uma dessas opções, esta é a vencedora. Se houver múltiplas opções, o(a) eleitor(a) com o voto de minerva escolhe qual das opções ganha.

source: Note: Options which the voters rank above the default option are options they find acceptable. Options ranked below the default options are options they find unacceptable.
pt_pt: Nota: as opções que os(as) votantes graduam acima da opção padrão são opções que eles(as) acham aceitáveis. Opções graduadas abaixo da opção padrão são opções que eles(as) acham inaceitáveis.

source: When the vote counting mechanism of the Standard Resolution Procedure is to be used, the text which refers to it must specify who has a casting vote, the quorum, the default option, and any supermajority requirement. The default option must not have any supermajority requirements.
pt_pt: Quando for utilizado o mecanismo de contagem de votos do procedimento padrão de resolução, o texto que a ele se refere deve especificar quem tem voto de minerva, o quórum, a opção padrão e qualquer requisito de supermaioria. A opção padrão não deve ter nenhum requisito de supermaioria.

source: B. Use of language and typography
pt_pt: B. Uso de linguagem e tipografia

source: The present indicative (is, for example) means that the statement is a rule in this constitution. May or can indicates that the person or body has discretion. Should means that it would be considered a good thing if the sentence were obeyed, but it is not binding. Text marked as a citation, such as this, is rationale and does not form part of the constitution. It may be used only to aid interpretation in cases of doubt.
pt_pt: O presente do indicativo (é, por exemplo) significa que a declaração é uma regra nesta constituição. Pode indica que a pessoa ou grupo tem liberdade de ação. Deveria significa que será considerado uma boa coisa se a sentença for obedecida, mas não é obrigatória. Texto marcado como citação, como este, é uma análise racional e não é parte da constituição. Ele pode ser usado apenas para ajudar na interpretação em casos duvidosos.

source: dansk Deutsch español français Italiano Nederlands 日本語 (Nihongo) polski Português Русский (Russkij) svenska 中文(简) 中文(HK) 中文(繁)
pt_pt: dansk Deutsch English español français Italiano Nederlands 日本語 (Nihongo) polski Русский (Russkij) svenska 中文(简) 中文(HK) 中文(繁)

source: Last Modified: Wed, Oct 5 01:34:52 UTC 2022 Last Built: Tue, Aug 6 19:40:09 UTC 2024
pt_pt: Última Modificação: Seg, 10 de Out de 2022, 19:46:12 UTC Última compilação: Ter, 6 de Ago de 2024, 22:04:30 UTC

source: Documentation / Debian Developers' Manuals
pt_pt: Documentação / Manuais de desenvolvedores(as) Debian

source: Debian Developers' Manuals
pt_pt: Manuais de desenvolvedores(as) Debian

source: · Debian Policy Manual
pt_pt: · Manual de políticas Debian

source: · Debian Developer's Reference
pt_pt: · Referência para desenvolvedores(as) Debian

source: · Guide for Debian Maintainers
pt_pt: · Guia para mantenedores(as) Debian

source: · Debian New Maintainers' Guide
pt_pt: · Guia de novos(as) mantenedores(as) Debian

source: · Introduction to Debian packaging
pt_pt: · Introdução ao empacotamento Debian

source: · Debian Menu System
pt_pt: · Sistema de menus do Debian

source: · Debian Installer internals
pt_pt: · Mecanismos do instalador Debian

source: · dbconfig-common documentation
pt_pt: · Documentação dbconfig-common

source: Debian Policy Manual
pt_pt: Manual de políticas Debian

source: This manual describes the policy requirements for the Debian GNU/Linux distribution.
pt_pt: Este manual descreve os requisitos da política para a distribuição Debian GNU/Linux.

source: This includes the structure and contents of the Debian archive, several design issues of the operating system, as well as technical requirements that each package must satisfy to be included in the distribution.
pt_pt: Isto inclui a estrutura e os conteúdos do repositório Debian, várias questões de design do sistema operacional e os requerimentos técnicos que cada pacote deve atender para ser incluído na distribuição.

source: Authors: Ian Jackson, Christian Schwarz, David A. Morris
pt_pt: Autores(as): Ian Jackson, Christian Schwarz, David A. Morris

source: Maintainer: The Debian Policy group
pt_pt: Mantenedor(a): The Debian Policy group

source: Availability: Debian package debian-policy
pt_pt: Disponibilidade: Pacote Debian debian-policy

source: · English: [HTML] [PDF] [EPUB] [plain text]
pt_pt: · Inglês: [HTML] [PDF] [EPUB] [texto puro]

source: · Web interface: https://salsa.debian.org/dbnpolicy/policy
pt_pt: · Interface web: https://salsa.debian.org/dbnpolicy/policy

source: · VCS interface: git clone https://salsa.debian.org/dbnpolicy/policy.git
pt_pt: · Interface VCS: git clone https://salsa.debian.org/dbnpolicy/policy.git

source: Proposed amendments to Policy
pt_pt: Propostas de emendas para as políticas

source: Supplemental Policy documentation:
pt_pt: Documentações suplementares das políticas:

source: · Filesystem Hierarchy Standard [PDF] [plain text]
pt_pt: · Hierarquia padrão do sistema de arquivos [pdf] [texto puro]

source: · Upgrading checklist
pt_pt: · Lista de verificação de atualização

source: · Virtual package names list
pt_pt: · Listas de nomes de pacotes virtuais

source: · Menu policy [plain text]
pt_pt: · Política de menus [texto puro

source: · Perl policy [plain text]
pt_pt: · Política Pearl [texto puro]

source: · debconf specification
pt_pt: · especificação debconf

source: · Emacsen policy
pt_pt: · Política Emacsen

source: · Java policy
pt_pt: · Política Java

source: · Python policy
pt_pt: · Política Python

source: · copyright-format specification
pt_pt: · especificação de formato de direitos autorais

source: Debian Developer's Reference
pt_pt: Referência para desenvolvedores(as) Debian

source: This manual describes procedures and resources for Debian maintainers.
pt_pt: Este manual descreve procedimentos e recursos para mantenedores(as) Debian.

source: It describes how to become a new developer, the upload procedure, how to handle our bug tracking system, the mailing lists, Internet servers, etc.
pt_pt: Descreve como se tornar um(a) novo(a) desenvolvedor(a), o procedimento de upload, como lidar com o nosso sistema de acompanhamento de bugs, as listas de discussão, servidores de Internet, etc.

source: This manual is thought as a reference manual for all Debian developers (newbies and old pros).
pt_pt: Este manual foi criado como um manual de referência para todos(as) os(as) desenvolvedores(as), novatos(as) ou veteranos(as).

source: Authors: Ian Jackson, Christian Schwarz, Lucas Nussbaum, Raphaël Hertzog, Adam Di Carlo, Andreas Barth
pt_pt: Autores(as): Ian Jackson, Christian Schwarz, Lucas Nussbaum, Raphaël Hertzog, Adam Di Carlo, Andreas Barth

source: Maintainer: Lucas Nussbaum, Hideki Yamane, Holger Levsen
pt_pt: Mantenedor(a): Lucas Nussbaum, Hideki Yamane, Holger Levsen

source: Availability: Debian package developers-reference
pt_pt: Disponibilidade: Pacote Debian developers-reference

source: · English: [HTML] [HTML (single page)] [PDF] [plain text] [EPUB]
pt_pt: · Inglês: [HTML] [HTML (single page)] [PDF] [texto puro] [EPUB]

source: · German: [HTML] [HTML (single page)] [PDF] [plain text] [EPUB]
pt_pt: · Alemão: [HTML] [HTML (single page)] [PDF] [texto puro] [EPUB]

source: · French: [HTML] [HTML (single page)] [PDF] [plain text] [EPUB]
pt_pt: · Francês: [HTML] [HTML (single page)] [PDF] [texto puro] [EPUB]

source: · Italian: [HTML] [HTML (single page)] [PDF] [plain text] [EPUB]
pt_pt: · Italiano: [HTML] [HTML (single page)] [PDF] [texto puro] [EPUB]

source: · Japanese: [HTML] [HTML (single page)] [PDF] [plain text] [EPUB]
pt_pt: · Japonês: [HTML] [HTML (single page)] [PDF] [texto puro] [EPUB]

source: · Russian: [HTML] [HTML (single page)] [PDF] [plain text] [EPUB]
pt_pt: · Russo: [HTML] [HTML (single page)] [PDF] [texto puro] [EPUB]

source: · Web interface: https://salsa.debian.org/debian/developers-reference
pt_pt: · Interface web: https://salsa.debian.org/debian/developers-reference

source: · VCS interface: git clone https://salsa.debian.org/debian/developers-reference.git
pt_pt: · Interface VCS: git clone https://salsa.debian.org/debian/developers-reference.git

source: Guide for Debian Maintainers
pt_pt: Guia para mantenedores(as) Debian

source: This tutorial document describes the building of the Debian package to ordinary Debian users and prospective developers using the debmake command.
pt_pt: Este tutorial descreve a construção de um pacote Debian para usuários(as) comuns e futuros(as) desenvolvedores(as) usando o comando debmake.

source: It is focused on the modern packaging style and comes with many simple examples.
pt_pt: O manual é focado no estilo moderno de empacotamento e vem com muitos exemplos simples.

source: · POSIX shell script packaging
pt_pt: · Empacotamento script shell POSIX

source: · Python3 script packaging
pt_pt: · Empacotamento de script Python3

source: · C with Makefile/Autotools/CMake
pt_pt: · C com Makefile / Autotools / CMake

source: · multiple binary packages with shared library etc.
pt_pt: · Pacotes binários múltiplos com biblioteca compartilhada etc.

source: This “Guide for Debian Maintainers” can be considered as the successor to the “Debian New Maintainers’ Guide”.
pt_pt: Este “Guia para mantenedores(as) Debian” pode ser considerado como o sucessor do "guia Debian para novos(as) mantenedores(as)".

source: Authors: Osamu Aoki
pt_pt: Autores(as): Osamu Aoki

source: Maintainer: Osamu Aoki
pt_pt: Mantenedor(a): Osamu Aoki

source: Availability: Debian package debmake-doc
pt_pt: Disponibilidade: Pacote Debian debmake-doc

source: · Web interface: https://salsa.debian.org/debian/debmake-doc
pt_pt: · Interface web: https://salsa.debian.org/debian/debmake-doc

source: · VCS interface: git clone https://salsa.debian.org/debian/debmake-doc.git
pt_pt: · Interface VCS: git clone https://salsa.debian.org/debian/debmake-doc.git

source: Debian New Maintainers' Guide
pt_pt: Guia de novos(as) mantenedores(as) Debian

source: This document will try to describe building of a Debian GNU/Linux package to the common Debian user (and wannabe developer) in common language, and well covered with working examples.
pt_pt: Este documento tentará descrever a construção de um pacote Debian GNU/Linux para o(a) usuário(a) comum do Debian (e desenvolvedor(a) aspirante) em linguagem comum, e bem coberto com exemplos.

source: Unlike previous attempts, this one is based on debhelper and the new tools available to maintainers.
pt_pt: Diferentemente das tentativas anteriores, esta é baseada no debhelper e nas novas ferramentas disponíveis para os(as) mantenedores(as).

source: The author is making every attempt to incorporate and unify previous efforts.
pt_pt: O autor está fazendo todos os esforços para incorporar e unificar esforços anteriores.

source: Authors: Josip Rodin, Osamu Aoki
pt_pt: Autores(as): Josip Rodin, Osamu Aoki

source: Status: outdated, use above “Guide for Debian Maintainers” (debmake-doc)
pt_pt: Estado: desatualizado, use o "Guia para mantenedores(as) Debian" acima (debmake-doc)

source: Availability: Debian package maint-guide
pt_pt: Disponibilidade: Pacote Debian maint-guide

source: · Catalan: [HTML] [plain text] [PDF]
pt_pt: · Catalão: [HTML] [texto puro] [PDF]

source: · Web interface: https://salsa.debian.org/debian/maint-guide
pt_pt: · Interface web: https://salsa.debian.org/debian/maint-guide

source: · VCS interface: git clone https://salsa.debian.org/debian/maint-guide.git
pt_pt: · Interface VCS: git clone https://salsa.debian.org/debian/maint-guide.git

source: Introduction to Debian packaging
pt_pt: Introdução ao empacotamento Debian

source: This tutorial is an introduction to Debian packaging.
pt_pt: Este tutorial é uma introdução ao empacotamento Debian.

source: It teaches prospective developers how to modify existing packages, how to create their own packages, and how to interact with the Debian community.
pt_pt: Ele ensina potenciais desenvolvedores(as) como modificar pacotes existentes, como criar seus próprios pacotes, e como interagir com a comunidade Debian.

source: In addition to the main tutorial, it includes three practical sessions on modifying the grep package, and packaging the gnujump game and a Java library.
pt_pt: Além do tutorial principal, ele inclui três sessões práticas sobre a modificação do pacote grep, e o empacotamento do jogo gnujump e de uma biblioteca Java.
